js_project_backend/app/controllers/pets_controller.rb

    def create
        if Pet.find_by(user_id: pet_params[:user_id])
            pet = Pet.find_by(user_id: pet_params[:user_id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = ? LIMIT ?  [["user_id", 7], ["LIMIT", 1]]
SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]