js_project_backend/app/controllers/pets_controller.rb

    def index
        pets = Pet.all
---
SELECT "pets".* FROM "pets"

    def show
        pet = Pet.find_by(id: params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        if Pet.find_by(name: pet_params[:name])
            pet = Pet.find_by(name: pet_params[:name])
            redirect_to pet_path(pet)
        else
            pet = Pet.create(pet_params)
---
SELECT "pets".* FROM "pets" WHERE "pets"."name" = ? LIMIT ?  [["name", "Mishka"], ["LIMIT", 1]]
INSERT INTO "pets" ("kind", "name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["kind", "Dog"], ["name", "Mishka"], ["user_id", 1], ["created_at", "2020-05-04 21:30:23.749966"], ["updated_at", "2020-05-04 21:30:23.749966"]]

    def update
        pet = Pet.find(params[:id])
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]