js_project_backend/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        task = Task.find_by(id: params[:id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."title" = ? LIMIT ?  [["title", "Hi"], ["LIMIT", 1]]
---
    def create
        if Task.find_by(title: task_params[:title])
            task = Task.find_by(title: task_params[:title])

INSERT INTO "tasks" ("title", "comment", "time", "complete", "pet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "Hi"], ["comment", "Bye"], ["time", "2020-05-05 14:13:00"], ["complete", 0], ["pet_id", 16], ["created_at", "2020-05-05 18:13:30.157442"], ["updated_at", "2020-05-05 18:13:30.157442"]]
---
            task = Task.create(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 41]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]
---
        task = Task.find_by(id: params[:id]).destroy