js_project_backend/app/controllers/users_controller.rb

    def create
        if User.find_by(name: user_params[:name])
            user = User.find_by(name: user_params[:name])
            redirect_to "/users/#{user.id}"
        else
            user = User.create(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Iskra"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Amelia"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Vincent"], ["created_at", "2020-05-06 02:14:15.859086"], ["updated_at", "2020-05-06 02:14:15.859086"]]